{
    "translations": {
        "Foydalanishni boshqarishning asosan nechta turi bor?": "4",
        "Shaxsning, axborot kommunikatsiya tizimidan foydalanish huquqiga ega bo‘lish uchun foydalaniluvchining maxfiy bo‘lmagan qayd yozuvi – bu…": "login",
        "Kriptografiyada kalitning vazifasi nima?": "Matnni shifrlash va shifrini ochish uchun kerakli axborot",
        "Qog‘oz ma’lumotlarni yo‘q qilish odatda necha xil usuldan foydalaniladi?": "4",
        "Autentifikatsiya nima?": "Ma’lum qilingan foydalanuvchi, jarayon yoki qurilmaning haqiqiy ekanligini tekshirish muolajasi",
        "Identifikatsiya bu-": "Foydalanuvchini uning identifikatori (nomi) bo‘yicha aniqlash jarayoni",
        "Kriptobardoshlilik deb nimaga aytilladi?": "Kalitlarni bilmasdan shifrni ochishga bardoshlilikni aniqlovchi shifrlash tavsifi",
        "Kriptografiyada matn –bu": "Alifbo elementlarining tartiblangan to‘plami",
        "Kriptotizimga qo‘yiladigan umumiy talablardan biri nima?": "Shifr matn uzunligi ochiq matn uzunligiga teng bo‘lishi kerak",
        "Berilgan ta’riflardan qaysi biri assimetrik tizimlarga xos?": "Assimetrikrik kriptotizimlarda k1≠k2 bo‘lib, k1 ochiq kalit, k2 yopiq kalit deb yuritiladi, k1 bilan axborot shifrlanadi, k2 bilan esa deshifrlanadi",
        "Qaysi juftlik RSA algoritmining ochiq va yopiq kalitlarini ifodalaydi?": "{d, n} – yopiq, {e, n} – ochiq",
        "Zamonaviy kriptografiya qanday bo‘limlardan iborat?": "Simmetrik kriptotizimlar; Ochiq kalitli kriptotizimlar; Elektron raqamli imzo; Kalitlarni boshqarish",
        "Shifr nima?": "Shifrlash va deshifrlashda foydalaniladigan matematik funktsiyadan iborat bo‘lgan kriptografik algoritm",
        "Ochiq kalitli kriptotizimlarning mohiyati nimadan iborat?": "Ochiq kalitli kriptotizimlarda bir-biri bilan matematik bog‘langan 2 ta – ochiq va yopiq kalitlardan foydalaniladi",
        "Ma’lumotlar butunligi qanday algoritmlar orqali amalga oshiriladi?": "Simmetrik algoritmlar",
        "Identifikatsiya, autentifikatsiya jarayonlaridan o‘tgan foydalanuvchi uchun tizimda bajarishi mumkin bo‘lgan amallarga ruxsat berish jarayoni bu...": "Avtorizatsiya",
        "Autentifikatsiya faktorlari nechta?": "3 ta",
        "Ko‘z pardasi, yuz tuzilishi, ovoz tembri, bular autentifikatsiyaning qaysi faktoriga mos belgilar?": "Biometrik autentifikatsiya",
        "Shifrlash kaliti noma’lum bo‘lganda shifrlangan ma’lumotni deshifrlash qiyinlik darajasini belgilaydigan atamani toping": "Kriptobardoshlik",
        "Ma’lumotlarni tasodifiy sabablar tufayli yo‘qolish sababini belgilang": "Quvvat o‘chishi, dasturiy ta’minot to‘satdan o‘zgarishi yoki qurilmani to‘satdan zararlanishi",
        "Ma’lumotlarni inson xatosi tufayli yo‘qolish sababini belgilang": "Ma’lumotlarni saqlash vositasini to‘g‘ri joylashtirilmagani yoki ma’lumotlar bazasini xatolik bilan boshqarilganligi.",
        "\"Parol', \"PIN\" kodlarni xavfsizlik tomonidan kamchiligi nimadan iborat?": "Foydalanish davrida maxfiylik kamayib boradi",
        "Nima uchun autentifikatsiyalashda parol ko‘p qo‘llaniladi?": "Sarf xarajati kam, almashtirish oson",
        "Elektron hujjatlarni yo‘q qilish usullari qaysilar?": "Shredirlash, magnitsizlantirish, yanchish",
        "Yuliy Sezar ma’lumotlarni shifrlashda alfavit harflarni nechtaga surib shifrlagan?": "3 taga",
        "Parollash siyosatiga ko'ra parol tanlash shartlari qanday?": "Kamida 8 belgi; katta va kichik harflar, sonlar, kamida bitta maxsus simvol qo‘llanishi kerak",
        "MD5, SHA1, SHA256, O‘z DSt 1106:2009- qanday algoritmlar deb ataladi?": "Xeshlash",
        "Qaysi siyosatda administrator xavfsiz va zarur xizmatlarga individual ravishda ruxsat beradi?": "Ehtiyotkorlik siyosati",
        "Qaysi siyosatga ko‘ra faqat ma'lum xavfli xizmatlar/hujumlar yoki harakatlar bloklanadi?": "Ruxsat berishga asoslangan siyosat",
        "Qaysi siyosatga ko‘ra hamma narsa taqiqlanadi?": "Paranoid siyosat",
        "Tashkilotni himoyalash maqsadida amalga oshirilgan xavfsizlik nazoratini tavsiflovchi yuqori sathli hujjat yoki hujjatlar to‘plami nima deyiladi?": "Xavfsizlik siyosati",
        "Xavfsizlikni ta’minlashning bir yoki bir necha tizimi hamda loyihalashni nazoratlash va ulardan foydalanish xususida to‘liq tasavvurga ega shaxs kim deb ataladi?": "Xavfsizlik ma'muri (admin)",
        "Axborot xavfsizligining huquqiy ta'minoti qaysi me’yorlarni o‘z ichiga oladi?": "Xalqaro va milliy huquqiy me’yorlarni",
        "Ehtiyotkorlik siyosati (Prudent Policy) – bu …": "Barcha xizmatlar blokirovka qilingandan so‘ng bog‘lanadi",
        "... - faqat foydalanuvchiga ma’lum va biror tizimda autentifikatsiya jarayonidan o‘tishni ta’minlovchi biror axborot.": "Parol",
        "“Xodim xavfsizligi” tushunchasi- bu…": "Qandaydir jiddiy axborotdan foydalanish imkoniyatiga ega barcha xodimlarning kerakli avtorizatsiyaga va barcha kerakli ruxsatnomalarga egalik kafolatini ta’minlovchi usul",
        "Axborot xavfsizligi qanday asosiy xarakteristikalarga ega?": "Butunlik, konfidentsiallik, foydalaniluvchanlik",
        "Axborot xavfsizligining huquqiy ta'minotiga nimalar kiradi?": "Qonunlar, aktlar, me'yoriy-huquqiy hujjatlar, qoidalar, yo'riqnomalar, qo'llanmalar majmui",
        "\"Barcha xizmatlar blokirovka qilingandan so‘ng bog’lanadi\" -Bu qaysi xavfsizlik siyosatiga hos?": "Ehtiyotkorlik siyosati (Prudent Policy)",
        "Barcha simmetrik shifrlash algoritmlari qanday shifrlash usullariga bo‘linadi?": "Blokli va oqimli",
        "BestCrypt dasturi qaysi algoritmlardan foydalanib shifrlaydi?": "AES, Serpent, Twofish",
        "Blokli shifrlash tushunchasi nima?": "Shifrlanadigan matn blokiga qo‘llaniladigan asosiy akslantirish",
        "Elektron pochtaga kirishda foydalanuvchi qanday autentifikatsiyalashdan o‘tadi?": "Parol asosida",
        "Elektron raqamli imzo - bu …": "Xabar muallifi va tarkibini aniqlash maqsadida shifrmatnga qo‘shilgan qo‘shimcha",
        "….-mavjud tahdidni amalga oshirilgan ko‘rinishi bo‘lib, bunda kutilgan tahdid amalga oshiriladi.": "Hujum",
        "Muammoga qaratilgan xavfsizlik siyosatlari..": "Bu siyosatlar tashkilotdagi aynan xavfsizlik muammosiga qaratilgan bo‘lib, ushbu xavfsizlik siyosatlarining qamrovi va qo‘llanilish sohasi muammo turi va unda foydalanilgan usullarga bog‘liq bo‘ladi.",
        "Tizimga qaratilgan xavfsizlik siyosatlari …": "Mazkur xavfsizlik siyosatini amalga oshirishda tashkilotdagi biror tizimning umumiy xavfsizligini ta’minlash ko‘zda tutiladi",
        "Internetdan foydalanish siyosati. …": "Mazkur siyosat Internetdan foydalanishdagi cheklanishlarni aniqlab, xodimlar uchun Internet tarmog‘idan foydalanish tartibini belgilaydi.",
        "Ochiq matnni, har biri mos algoritm va kalit orqali aniqlanuvchi, shifrmatnga qaytariluvchan o‘zgartirishlar oilasi-…": "Kriptotizim",
        "O‘zgartirishlar oilasidan birini tanlashni ta’minlovchi kriptografik algoritmning qandaydir parametrlarining muayyan qiymati-…": "Kalit",
        "“Avtorizatsiya” atamasi qaysi tushuncha bilan sinonim sifatida ham foydalanadi?": "Foydalanishni boshqarish",
        "\"Axborot olish va kafolatlari va erkinligi to'g'risida\"gi Qonunning maqsadi nimadan iborat?": "Har kimning axborotni erkin va moneliksiz izlash, olish, tadqiq etish, uzatish hamda tarqatishga doir konstitutsiyaviy huquqini amalga oshirish jarayonida yuzaga keladigan munosabatlarni tartibga solish",
        "\"Axborotlashtirish to'g'risida\"gi Qonunning maqsadi nimadan iborat?": "Axborotlashtirish, axborot resurslari va axborot tizimlaridan foydalanish sohasidagi munosabatlarni tartibga solish.",
        "\"Backdoors\"-qanday zararli dastur?": "Zararli dasturiy kodlar bo'lib, hujumchiga autentifikatsiyani chetlab o'tish imkonini beradi.",
        "….. – o‘zida IMSI raqamini, autentifikatsiyalash kaliti, foydalanuvchi ma’lumoti va xavfsizlik algoritmlarini saqlaydi.": "Sim karta",
        "….. kompyuter tarmoqlari bo‘yicha tarqalib, kompyuterlarning tarmoqdagi manzilini aniqlaydi va u yerda o‘zining nusxasini qoldiradi.": "“Chuvalchang” va replikatorli virus",
        "Antivirus dasturlarini ko‘rsating.": "Drweb, Nod32, Kaspersky",
        "“Inson xavfsizligi” bilim sohasi - bu …": "Kiberxavfsizlik bilan bog‘liq inson hatti-harakatlarini o‘rganishdan tashqari, tashkilotlar (masalan, xodim) va shaxsiy hayot sharoitida shaxsiy ma’lumotlarni va shaxsiy hayotni himoya qilishga e’tibor qaratadi.",
        "“Tashkil etuvchilar xavfsizligi” - bu …": "Katta tizimlarda integrallashgan tashkil etuvchilarni loyihalash, sotib olish, testlash, analiz qilish va texnik xizmat ko‘rsatishga e’tibor qaratadi.",
        "“Tashkilot xavfsizligi” bilim sohasi - bu …": "Tashkilotni kiberxavfsizlik tahdidlaridan himoyalash va tashkilot vazifasini muvaffaqqiyatli bajarishini ta’minlash.",
        "…. protokolidan odatda o‘yin va video ilovalar tomonidan keng foydalaniladi.": "UDP",
        "….. protokoli ulanishga asoslangan protokol bo‘lib, internet orqali ma’lumotlarni almashinuvchi turli ilovalar uchun tarmoq ulanishlarini sozlashga yordam beradi.": "TCP",
        "Access control list va Capability list bu nimaning asosiy elementi hisoblanadi?": "Lampson matritsasining",
        "Antiviruslar viruslarni asosan qanday usulda aniqlaydi?": "Signaturaga asoslangan",
        "“Adware” zararli dastur xususiyati nimadan iborat?": "Marketing maqsadida yoki reklamani namoyish qilish uchun foydalanuvchini ko‘rish rejimini kuzatib boruvchi dasturiy ta’minot.",
        "Agar foydalanuvchi tizimda ma'lumot bilan ishlash vaqtida ham zahiralash amalga oshirilishi …. deb ataladi?": "Issiq zaxiralash",
        "Qaysi zaxiralash usuli offlayn zaxiralash deb ham atalib, tizim ishlamay turganida yoki foydalanuvchi tomonidan boshqarilmagan vaqtda amalga oshiriladi?": "Sovuq zaxiralash",
        "Qaysi zaxiralashda tizim muntazam yangilanishni amalga oshirish uchun tarmoqqa bog‘lanishi kerak bo‘ladi?": "Iliq zaxiralash",
        "Agar RSA algoritmida e-ochiq kalitni, d-maxfiy kalitni, n-modul ifodalasa, qaysi formula deshifrlashni ifodalaydi?": "M = C^d mod n;",
        "Agar RSA algoritmida e-ochiq kalitni, d-maxfiy kalitni, n-modul ifodalasa, qaysi formula shifrlashni ifodalaydi?": "C = M^e mod n;",
        "Aksariyat tijorat tashkilotlari uchun ichki tarmoq xavfsizligini ta’minlashning zaruriy sharti-bu...": "Tarmoqlararo ekranlarning o‘rnatilishi",
        "Akslantirish tushunchasi deb nimaga aytiladi?": "1-to‘plamli elementlariga 2-to‘plam elementlariga mos bo‘lishiga",
        "Antiviruslarni, qo‘llanish usuliga ko‘ra turlari mavjud.": "Detektorlar, faglar, vaktsinalar, privivkalar, revizorlar, monitorlar",
        "AQShning axborotni shifrlash standartini keltirilgan javobni ko‘rsating?": "DES (Data Encryption Standard)",
        "Assimmetrik kriptotizimlar qanday maqsadlarda ishlatiladi?": "Shifrlash, deshifrlash, ERI yaratish va tekshirish, kalitlar almashish uchun",
        "Assimmetrik kriptotizimlarda axborotni shifrlashda va deshifrlash uchun nechta kalit ishlatiladi?": "Ikkita kalit",
        "Asosan tarmoq, tizim va tashkilot haqidagi axborotni olish maqsadida amalga oshiriladigan tarmoq hujumini belgilang.": "Razvedka hujumlari",
        "Attribute based access control (ABAC) usuli attributlari qaysilar?": "Foydalanuvchi attributlari",
        "Autentifikatsiyaga ta'rif qaysi javobda keltirilgan?": "Ma`lum qilingan foydalanuvchi, jarayon yoki qurilmaning haqiqiy ekanligini tekshirish muolajasi",
        "Axborotning eng kichik o‘lchov birligi nima?": "bit",
        "“Bag” atamasi nima ma'noni beradi?": "Dasturiy ta’minotni amalga oshirish bosqichiga tegishli bo'lgan muammo",
        "Avtorizatsiya qanday jarayon?": "Foydalanuvchining resursdan foydalanish huquqlari va ruxsatlarini tekshirish jarayoni",
        "Axborot himoyasi nuqtai nazaridan kompyuter tarmoqlarini nechta turga ajratish mumkin?": "Korporativ va umumfoydalanuvchi",
        "Axborot paketlarini qachon ushlab qolish mumkin?": "Aloqa kanallari orqali uzatishda",
        "Axborot tizimi tarkibidagi elektron shakldagi axborot, ma`lumotlar banki, ma`lumotlar bazasi nima deb ataladi?": "Axborot resursi",
        "Axborot tizimiga ta’rif bering.": "Qo‘yilgan maqsadga erishish yo‘lida axborotlarni olish, qayta ishlash va uzatish uchun usullar, vositalar va xodimlar jamlanmasi",
        "Axborot xavfsizligi siyosatining necha xil turi bor?": "3",
        "Axborot tizimlari xavfsizligining auditi bu…": "Axborot tizimlarining himoyalanishining joriy holati, tizim haqida obyektiv ma’lumotlarni olish va baholash",
        "TrueCrypt dasturi qaysi algoritmlardan foydalanib shifrlaydi?": "AES, Serpent va Twofish",
        "Axborot xavfsizligi siyosati – bu …": "Tashkilot o‘z faoliyatida rioya qiladigan axborot xavfsizligi sohasidagi hujjatlangan qoidalar, muolajalar, amaliy usullar yoki amal qilinadigan prinsiplar majmui sanalib, u asosida tashkilotda axborot xavfsizligi ta’minlanadi",
        "Axborot xavfsizligida axborotning bahosi qanday aniqlanadi?": "Axborot xavfsizligi buzilgan taqdirda ko‘rilishi mumkin bo‘lgan zarar miqdori bilan",
        "Axborot xavfsizligini ta'minlovchi choralarni ko‘rsating?": "1-huquqiy, 2-tashkiliy-ma'muriy, 3-dasturiy-texnik",
        "Axborotdan oqilona foydalanish kodeksi qaysi tashkilot tomonidan ishlab chiqilgan?": "AQSH sog'liqni saqlash va insonlarga xizmat ko'rsatish vazirligi",
        "Axborotlarni saqlovchi va tashuvchi vositalar qaysilar?": "USB fleshka, CD va DVD disklar",
        "Axborotni himoyalash uchun ... usullari qo‘llaniladi.": "Kodlashtirish, kriptografiya, stegonografiya",
        "Axborotning buzilishi yoki yo‘qotilishi xavfiga olib keluvchi himoyalanuvchi obyektga qarshi qilingan harakatlar qanday nomlanadi?": "Tahdid",
        "Barcha kabel va tarmoq tizimlari; tizim va kabellarni fizik nazoratlash; tizim va kabel uchun quvvat manbai; tizimni madadlash muhiti - bular tarmoqning qaysi sathiga kiradi?": "Fizik sath (physical)",
        "Bell-LaPadula (BLP) modeli - bu...": "Bu hukumat va harbiy dasturlarda kirishni boshqarishni kuchaytirish uchun ishlatiladigan avtomatlashgan model",
        "Bell-LaPadula axborot xavfsizligida axborotni qaysi parametrini ta'minlash uchun xizmat qiladi?": "Konfidentsiallikni",
        "Biba modeli obyektni qaysi xususiyatiga e'tibor qaratadi?": "Yaxlitligi",
        "Biba modeli qaysi modelning kengaytirilgan varianti hisoblanadi?": "Bell-LaPadula modeli",
        "Biometrik parametrlarda xavfsizlik tomonidan kamchiligi nimadan iborat?": "ID ni almashtirish murakkabligi",
        "Bluetooth, IEEE 802.15, IRDA standartida ishlovchi simsiz tarmoq turini aniqlang.": "Shaxsiy simsiz tarmoq",
        "Botnet nima?": "Internet tarmog'idagi obro'sizlantirilgan kompyuterlar bo'lib, taqsimlangan hujumlarni amalga oshirish uchun hujumchi tomonidan foydalaniladi",
        "Elektr signallarini qabul qilish va uzatish vazifalarini OSI modelining qaysi sathi bajaradi?": "Fizik sath (physical)",
        "Bu so‘z ingliz tilidan olingan bo‘lib - yorib tashlash, chopish, buzish degan ma’nolarni anglatadi. Ular haddan ziyod malakali va bilimli, axborot texnologiyalarini puxta biluvchi insondir. Yuqoridagi fikr kim to‘g‘risida ta’rif berilgan?": "Xaker",
        "Bulutli texnologiyalarda PaaS nimani ifodalaydi?": "Platforma sifatida",
        "GSM, GPRS, EDGE, HSPA+, LTE standartida ishlovchi simsiz tarmoq turini aniqlang.": "Global simsiz tarmoq",
        "Cloud Computing texnologiyasi nechta katta turga ajratiladi?": "3 turga",
        "Dastur kodini tashkil qilish yondashuviga ko‘ra viruslar turlari?": "Shifrlangan, shifrlanmagan, polimorf",
        "Dasturiy shifrlash vositalari necha turga bo‘linadi?": "4",
        "Dasturlarni buzish va undagi mualliflik huquqini buzush uchun yo‘naltirilgan buzg‘unchi bu - ...": "Krakker",
        "DIR viruslari nimani zararlaydi?": "FAT tarkibini zararlaydi",
        "Diskni shifrlash nima uchun amalga oshiriladi?": "Ma’lumotni saqlash vositalarida saqlangan ma’lumot konfidensialligini ta’minlash uchun amalga oshiriladi",
        "Doktorlar, detektorlarga xos bo'lgan ishni bajargan holda zararlangan fayldan viruslarni chiqarib tashlaydigan va faylni oldingi holatiga qaytaradigan dasturiy ta'minot nomini belgilang:": "Faglar",
        "Elektron raqamli imzo tizimi qanday muolajalarni amalga oshiradi?": "Raqamli imzoni shakllantirish va tekshirish muolajasi",
        "Eng ko'p axborot xavfsizligini buzilish holati - bu:": "Tarmoqda ruxsatsiz ichki foydalanish",
        "Enterprise Information Security Policies, EISP - bu…": "Tashkilot axborot xavfsizligi siyosati",
        "Ethernet konsentratori (hub) qanday vazifani bajaradi?": "Kompyuterdan kelayotgan axborotni qolgan barcha kompyuterlarga yo‘naltirib beradi",
        "Faol hujum turi deb nimaga aytiladi?": "Maxfiy uzatish jarayonini uzib qo‘yish, modifikatsiyalash, qalbaki shifr ma’lumotlar tayyorlash harakatlaridan iborat jarayon",
        "Faollashish prinsipiga ko‘ra viruslar turlari?": "Rezident, Norezident",
        "Faqat bir marta foydalaniluvchi, har bir sessiya uchun o‘zgarib turadigan parol nima deyiladi?": "One-time password (OTP)",
        "Faqat ma’lum xizmatlar/hujumlar/harakatlar bloklanadi. Bu qaysi xavfsizlik siyosatiga hos?": "Ruxsat berishga asoslangan siyosat (Permissive Policy)",
        "Fire Wall ning vazifasi...": "Tarmoqlar orasida aloqa o‘rnatish jarayonida tashkilot va Internet tarmog‘i orasida xavfsizlikni ta`minlaydi",
        "Fizik to‘siqlarni o‘rnatish, xavfsizlik qo‘riqchilarini ishga olish, fizik qulflar qo‘yishni amalga oshirish qanday nazorat turiga kiradi?": "Fizik nazorat",
        "Fizik xavfsizlikda yong‘inga qarshi tizimlar necha turga bo‘linadi?": "2 taga",
        "Fizik xavfsizlikni nazoratlashga nimalar kiradi?": "Binoga to‘siqlar qo‘yish, eshikka qulflar o‘rnatish, xavfsizlik xodimlarini ishga olish",
        "Foydalanish huquqini cheklovchi matritsa modeli bu...": "Bell-LaPadula modeli",
        "Foydalanish huquqlariga (mualliflikka) ega barcha foydalanuvchilar axborotdan foydalanishlari - bu…": "Foydalanuvchanligi",
        "Foydalanishda boshqarishda ma’lumot, resurs, jarayon nima deb ataladi?": "Obyekt",
        "Foydalanishni boshqarish – bu...": "Subyektni obyektga ishlash qobiliyatini aniqlashdir.",
        "Foydalanishni boshqarishda inson, dastur, jarayon va xokazolar qanday vazifani bajaradi?": "Subyekt",
        "Foydalanishni boshqarishda subyekt bu - ....": "Inson, dastur, jarayon",
        "Foydalanishni boshqarishning ….. usuli tizimdagi shaxsiy obyektlarni himoyalash uchun qo‘llaniladi?": "Discretionary access control (DAC)",
        "Foydalanishni boshqarishning ….usulida foydalanishlar subyektlar va obyektlarni klassifikatsiyalashga asosan boshqariladi": "Mandatory access control (MAC)",
        "Foydalanishni boshqarishning …. usulida ruxsatlar va harakatni kim bajarayotganligi to‘g‘risidagi xolatlar “agar, u xolda” buyrug‘idan tashkil topgan qoidalarga asoslanadi.": "Attribute-based access control (ABAC)",
        "Foydalanishni boshqarishning …. usulida subyekt va obyektlarga tegishli huquqlarni ma’murlash oson kechadi.": "Role-based access control (RBAC)",
        "Foydalanishni boshqarishning …. usulida xavfsizlik markazlashgan tarzda xavfsizlik siyosati ma’muri tomonidan amalga oshiriladi.": "Mandatory access control (MAC)",
        "Foydalanishni boshqarishning Discretionary access control (DAC) usulidan asosan ….. qo‘llaniladi.": "Operatsion tizimlarda",
        "Tarmoqda foydalanuvchilarga tegishli ma’lumotlarini qo‘lga kiritib, uni hujum qiluvchiga yuboraradigan dasturiy kod qanday ataladi?": "Spyware",
        "Kompyuter tarmoqdagi foydalanuvchilar harakatini, uning axborot resurslardan foydalanishga urinishini qayd etish qaysi atama bilan nomlanadi?": "Ma’murlash",
        "Global tarmoq dastlab paytda qaysi nom bilan atalgan?": "ARPANET",
        "Identifikatsiya va autentifikatsiyadan o‘tgan foydalanuvchilarga tizimda bajarishi mumkin bo‘lgan amallarga ruxsat berish jarayoni – bu..": "Avtorizatsiya",
        "IEEE 802.11, Wi-Fi standartini qo’llovchi tarmoq turini aniqlang.": "Lokal simsiz tarmoq",
        "IEEE 802.16, WiMAX standartini qo’llovchi tarmoq turini aniqlang.": "Shahar simsiz tarmoq",
        "Elektron imzoni haqiqiyligini tekshirish … amalga oshiriladi.": "Imzo muallifining ochiq kaliti yordamida",
        "DoS hujumlari oqibati quyidagilardan qaysi biri sodir bo’ladi?": "Foydalanuvchilar kerakli axborot resurslariga murojaat qilish imkoniyatidan mahrum qilinadilar",
        "Kriptografiyada “Kalit” atamasiga qanday ta’rif beriladi?": "Axborotni shifrlash va deshifrlash uchun kerakli axborot",
        "Kalitlar boshqaruvi qanday elementga ega bo‘ladi?": "Hosil qilish, yig‘ish, taqsimlash",
        "Kiberxavfsizlikda “tahdid” atamasi qanday ta’riflanadi?": "Tizim yoki tashkilotga zarar yetkazishi mumkin bo'lgan istalmagan hodisa",
        "OSI modelining Transport sathida axborot tipi qanday nomlanadi?": "Segment/Datagramma",
        "Kiberxavfsizlikni ta’minlash masalalari bo‘yicha xavfsizlik siyosati shablonlarini ishlab chiqadigan yetakchi tashkilotni aniqlang.": "SANS (System Administration Networking and Security)",
        "Kimlar o‘zining harakatlari bilan sanoat josusi yetkazadigan muammoga teng (undan ham ko‘p bo‘lishi mumkin) muammoni yuzaga keltiradi?": "Ishonchsiz xodimlar",
        "Kompyuter bilan bog'liq falsafiy soha bo'lib, foydalanuvchilarning xatti-harakatlari, kompyuterlar nimaga dasturlashtirilganligi va umuman insonlarga va jamiyatga qanday ta'sir ko'rsatishini o'rgatadigan soha nima deb ataladi?": "Kiberetika",
        "Tarmoq qurilmalari IPv4 manzilni to'g'ri kiritilishini ko'rsating.": "172.25.100.100",
        "Bir biriga osonlik bilan ma’lumot va resurslarni taqsimlash uchun ulangan kompyuterlar guruhi…": "Kompyuter tarmoqlari",
        "….kompyuter tizimiga tahdid qilish imkoniyatiga ega va troyanlar, viruslar, “qurt”lar ko‘rinishida bo‘lishi mumkin.": "Zararli dastur",
        "….bir qarashda yaxshi va foydali kabi ko‘rinuvchi dasturiy vosita sifatida o‘zini ko‘rsatsada, yashiringan zararli koddan iborat.": "Troyan otlari",
        "….zararli dasturiy vosita bo‘lib, biror mantiqiy shart qanoatlantirilgan vaqtda o‘z harakatini amalga oshiradi.": "Mantiqiy bombalar",
        "….keng qamrovli nishondagi tizim va tarmoq resurlarida xizmatdan foydalanishni buzishga qaratilgan hujum bo‘lib, Internetdagi ko‘plab zombi kompyuterlar orqali bilvosita amalga oshiriladi.": "Taqsimlangan DOS hujumlar",
        "…. hujumlari trafik orqali axborotni to‘plashga harakat qiladi. Buning uchun hujumchi sniffer deb nomlanuvchi dasturiy vositadan foydalanadi.": "Passiv razvedka hujumlari",
        "…. nishondagi kompyuter tizimi uchun nazoratni qo‘lga kiritish yoki ruxsatsiz foydalanish maqsadida amalga oshiriladi.": "Parolga qaratilgan hujumlar",
        "… hujumda hujum qiluvchi o‘rnatilgan aloqaga suqilib kiradi va aloqani uzadi:": "O‘rtada turgan odam hujumi",
        "Konfidentsial axborotdan foydalanish tushunchasi…": "Muayyan shaxsga tarkibida konfidensial xarakterli ma’lumot bo‘lgan axborot bilan tanishishga vakolatli mansabdor shaxsning ruxsati.",
        "Kriptoanaliz qanday jarayonlarni o‘rganadi?": "Kalitlarni bilmasdan shifrni ochishga bardoshlilikni aniqlovchi shifrlash tavsifi",
        "Kriptografiya qanday jarayonlarni o‘rganadi?": "Axborotni akslantirish va qayta akslantirishning matematik usullarini izlaydi va tadqiq qiladi",
        "Kriptologiya nechta yo‘nalishga bo’linadi?": "2 ta",
        "Kompyuter tarmoqlarda qo’llanuvchi topologiya turi qaysi?": "Yulduz, shina, xalqa",
        "Ma’lum qilingan foydalanuvchi, jarayon yoki qurilmaning haqiqiy ekanligini tekshirish jarayoni qanday ataladi?": "Autentifikatsiya",
        "Ma’lumotlarni zaxira nusxalash bu – …": "Muhim bo'lgan axborot nusxalash yoki saqlash jarayoni",
        "Turli offis ilovalari – MS Word hujjati, MS Excel elektron jadvali kabi fayllarni qaysi virus turi zararlaydi?": "Makroviruslar",
        "Ma'lumotlarni zahira nusxasini saqlovchi va qayta tikovchi dasturni belgilang.": "Redo Backup and Recovery",
        "Nomuntazam siyosat (Promiscuous Policy) nima?": "Tizim resurslaridan foydalanishda hech qanday cheklovlar qo‘ymaydi",
        "OSI modelining birinchi sathi nomini belgilang:": "Fizik sath (physical)",
        "OSI modelining ikkinchi sathi nomini belgilang:": "Kanal sath (data link)",
        "OSI modelining uchinchi sathi nomini belgilang:": "Tarmoq (network)",
        "OSI modelining to’rtinchi sathi nomini belgilang:": "Transport (transport)",
        "OSI modelining beshinchi sathi nomini belgilang": "Seans sath (session)",
        "OSI modelining oltinchi sathi nomini belgilang:": "Taqdimot (presentation)",
        "OSI modelining yettinchi sathi nomini belgilang": "Ilova sath (application)",
        "OSI modelida nechta sathdan iborat?": "7 ta",
        "OSI modelining Ilova sath (application) sathida qanday protokollar ishlaydi?": "HTTP, FTP, POP3, SMTP, WebSocket",
        "OSI modelining Taqdimot (presentation) sathida qaysi protokollar ishlaydi?": "ASCII, EBCDIC, JPEG, MIDI",
        "OSI modelining Transport sathida qaysi protokollar ishlaydi?": "TCP, UDP, SCTP",
        "OSI modelining Tarmoq (network) sathida qaysi protokollar ishlaydi?": "IPv4, IPv6, IPsec, AppleTalk, ICMP",
        "OSI modelining Kanal (data link) sathida qaysi protokollar ishlaydi?": "PPP, IEEE 802.22, Ethernet, DSL, ARP",
        "OSI modelining Fizik (physical) sathida qanday tarmoq qurilmalari qo’llaniladi?": "Kontsentrator",
        "OSI modelining Kanal (data link) sathida qanday tarmoq qurilmalar qo’llaniladi?": "Kommutator",
        "OSI modelining Tarmoq (network) sathida qanday tarmoq qurilmalar qo’llaniladi?": "Marshrutizator",
        "OSI modelining Fizik (physical) sathida axborot tipi qanday nomlanadi?": "bit",
        "OSI modelining Kanal (data link) sathida axborot tipi qanday nomlanadi": "bit/kadr",
        "OSI modelining Tarmoq (network) sathida axborot tipi qanday nomlanadi?": "paket",
        "Paranoid siyosati (Paranoid Policy) – bu ….": "Hamma narsa ta’qiqlanadi",
        "Polimorf viruslar tushunchasi to'g'ri ko'rsating.": "Viruslar turli ko'rinishdagi shifrlangan viruslar bo'lib, o'zining ikkilik shaklini nusxadan-nusxaga o'zgartirib boradi",
        "Qanday tarmoq qisqa masofalarda qurilmalar o‘rtasida ma’lumot almashinish imkoniyatini taqdim etadi?": "Shaxsiy tarmoq",
        "Qanday tizim host nomlari va internet nomlarini IP manzillarga o‘zgartirish yoki teskarisini amalga oshiradi?": "DNS tizimlari",
        "Qanday hujum asosiy hujumlarni oson amalga oshirish uchun tashkilot va tarmoq haqidagi axborotni to‘plashni maqsad qiladi?": "Razvedka hujumlari",
        "Qanday hujumda hujumchi turli texnologiyalardan foydalangan holda tarmoqqa kirishga harakat qiladi?": "Kirish hujumlari",
        "Quyidagi ta’riflardan qaysi biri tarmoqning sozlanishdagi zaifligini ifodalaydi?": "Tizim xizmatlarini xavfsiz bo‘lmagan tarzda sozlanishi, joriy sozlanish holatida qoldirish, parollarni noto‘g‘ri boshqarilishi",
        "PPP-kadrlarni tarmoq sathi paketlariga inkapsulyatsiyalovchi kanal sathining tunnel protokolini belgilang:": "L2TP (Layer 2 Tunneling Protocol)",
        "Quyidagi ta’riflardan qaysi biri tarmoqning texnologik zaifligini ifodalaydi?": "Tarmoq qurilmalari, svitch yoki routerlardagi autentifikatsiya usullarining yetarlicha bardoshli bo‘lmasligi",
        "Quyidagi ta’riflardan qaysi biri tarmoqning xavfsizlik siyosatidagi zaifligini ifodalaydi?": "Xavfsizlik siyosatidagi zaiflikni yuzaga kelishiga tashkilotning xavfsizlik siyosatida qoidalar va qarshi choralarni noto‘g‘ri ishlab chiqilgani sabab bo‘ladi",
        "Quyidagilardan lokal tarmoqqa berilgan ta’rifni belgilang.": "Kompyuterlar va ularni bog‘lab turgan qurilmalardan iborat bo‘lib, ular odatda bitta tarmoqda bo‘ladi.",
        "Quyidagilardan MAN (metropolitan area network) tarmoqqa berilgan ta’rifni belgilang.": "Bu tarmoq shahar yoki shaharcha bo‘ylab tarmoqlarning o‘zaro bog‘lanishini nazarda tutadi",
        "“nuqta-nuqta” xilidagi kanal sathining tunnel protokolini belgilang.": "PPTP (Point-to-Point Tunneling Protocol)",
        "Kompyuter tarmoqlaridan “Umumiy shina” topologiyasi xususiyati qanday?": "Tarmoqda yagona kabel barcha kompyuterlarni o‘zida birlashtiradi",
        "Kompyuter tarmoqlaridan “Yulduzsimon” topologiyasiga ta'rif bering.": "Har bir kompyuterni markaziy konsentrator bilan ulash orqali tashkil etiladi",
        "Kompyuter tarmoqlaridan “Xalqasimon” topologiyasiga ta'rif bering.": "Har bir kompyuter boshqa ikkita kompyuter bilan ulangan va signal aylana bo‘yicha o‘tadi",
        "Quyidagilardan qaysi birida tarmoqning “Uyali mesh” topologiyasiga ta'rif berilgan?": "Tarmoqdagi barcha kompyuter va tugunlar bir-biri bilan o‘zaro bog‘langan bo‘ladi",
        "Aksariyat tashkilotlar muhim ma’lumotlarini qaysi texnologiyasi asosida zaxira nusxalashni amalga oshiradilar?": "Random Array of Independent Disks (RAID)",
        "Risklarni boshqarish – bu…": "Risklarni aniqlash, baholash va minimallashtirish jarayoni",
        "Ransomware zararli dasturi axborotlarga qanday zarar keltiradi?": "Mazkur zararli dasturiy ta’minot qurbon kompyuterida mavjud qimmatli fayllarni shifrlaydi yoki qulflab qo'yib, to'lov amalga oshirilishini talab qiladi.",
        "Ma’murlash usuli bo’yicha tarmoqlar qanday turlarga bo’linadi?": "“Bir rangli” va “mijoz-server” turlarga",
        "Rezident bo‘lmagan viruslar qachon xotirani zararlaydi?": "Faqat faollashgan vaqtida",
        "Risk, tahdid, zaiflik va ta’sir tushunchalari o‘rtasida o‘zaro bog‘lanish qanday ifodalanadi?": "RISK = Tahdid x Zaiflik x Ta’sir",
        "Risk darajasi tarmoqga (yoki tizimga) natijaviy ta’sirning bahosi bo‘lib, quyidagi tenglik bilan ifodalanadi:": "Risk darajasi = natija * ehtimollik",
        "Samarali risklarni boshqarishning rejasi risklarni aniqlashni va baholashni kafolatli amalga oshirishda …. va qayta ko‘rib chiqishni talab etadi.": "Risk monitoringi",
        "Risk darajalari nechta turga bo’linadi?": "5 ta",
        "Risklarni boshqarish jarayoni quyidagi asosiy nechta bosqichga ajratiladi?": "4 ta",
        "Kompyuter tizimlarini qо‘riqlash, xodimlarni tanlash, maxsus muhim ishlarni bir kishi tomonidan bajarilishi hollariga yо‘l qо‘ymaslik qaysi choralarga kiradi?": "Tashkiliy",
        "…. tashkilotning risklarni boshqarish usuliga amalga oshirish tadbirlarini belgilaydi va tashkilotda axborot xavfsizligi va risklarni boshqarish bo‘yicha faoliyatni birlashtiruvchi tarkibiy jarayonni ta’minlaydi.": "Risklarni boshqarish freymworki",
        "Rootkitlar qanday zararli amallar bajaradi?": "Ushbu zararli dasturiy vosita operatsion tizim tomonidan aniqlanmasligi uchun ma’lum harakatlarini yashiradi",
        "Ruxsatlarni nazoratlash, “Qopqon”, Yong‘inga qarshi tizimlar, Yoritish tizimlari, Ogohlantirish tizimlari, Quvvat manbalari, Video kuzatuv tizimlari, Qurollarni aniqlash, Muhitni nazoratlash amalga oshirish qanday nazorat turiga kiradi?": "Fizik nazorat",
        "Shifrlash nima?": "Ochiq matnni shifrmatnga o‘zgartirish jarayoni",
        "Kriptotizim bu-…": "Ochiq matnni, har biri mos algoritm va kalit orqali aniqlanuvchi, shifrmatnga qaytariluvchan o‘zgartirishlar oilasi",
        "Simmetrik kriptotizimlarda ....": "Shifrlash va shifrni ochish uchun bitta va aynan shu kalitdan foydalaniladi",
        "Kompyuter ishlashida jiddiy nuqsonlarga sabab bo‘luvchi, natijada dastur va ma’lumotlar buzilishiga olib keluvchi viruslar qanday viruslar deb ataladi?": "Xavfli viruslar",
        "Simsiz tarmoqlarni kategoriyalarini to‘g‘ri ko‘rsating?": "Simsiz shaxsiy tarmoq, simsiz lokal tarmoq, simsiz shahar tarmoq va simsiz global tarmoq",
        "Spyware-qanday zararli dastur?": "Tarmoqda foydalanuvchilarga tegishli ma’lumotlarni qo‘lga kiritib, uni hujum qiluvchiga yuboradigan dasturiy kod.",
        "Subyekt identifikatorini tizimga yoki talab qilgan subyektga taqdim qilish jarayoni nima?": "Identifikatsiya",
        "Kompyuter virusining birinchi ta’rifini kim bergan?": "1984 yili Fred Koen",
        "Kompyuter viruslari hayot davrining ikkita asosiy bosqichini toping.": "Saqlanish va bajarilish",
        "Kompyuter viruslarining bajarilish davri, odatda, nechta bosqichni o‘z ichiga oladi?": "5 ta",
        "O‘z-o‘zidan tarqalish mexanizmi amalga oshiriluvchi, tizimga zarar keltirmaydi, faqat diskdagi bo‘sh xotirani sarflaydigan viruslar qanday viruslar deb ataladi?": "Beziyon viruslar",
        "Tizimda mavjudligi turli taassurot (ovoz, video) bilan bog‘liq, bo‘sh xotirani kamaytirsa-da, dastur va ma’lumotlarga ziyon yetkazmaydigan viruslar qanday viruslar deb ataladi?": "Xavfsiz viruslar",
        "Xizmat qilishdan voz kechishga undaydigan taqsimlangan hujum turini ko‘rsating.": "DDOS (Distributed Denial of Service) hujum",
        "Tarmoqlararo ekran (firewall, brandmaver) – bu…": "Trafikni filtrlash mexanizmiga asoslangan tarmoqdan foydalanishni cheklashning bazaviy vositasi.",
        "Kiruvchi ma’lumotning uzunligi o‘zgaruvchan, chiqishda esa o‘zgarmas uzunlikdagi qiymatni qaytaradigan jarayon qanday ataladi?": "Xesh funksiya",
        "Ochiq matn simvollari bir alfavitdan olinib, unga mos shifrmatn simvollari boshqa bir alfavitdan olinadigan jarayon nomini belgilang.": "O‘rniga qo‘yish akslantirish",
        "Ochiq matnda ishtirok etgan simvollar shifrmatnda ham ishtirok etib, faqat ularning o‘rni almashadigan jarayon nomini belgilang.": "O‘rin almashtirish akslantirishi",
        "…. tashkilotning va u bilan bog‘liq boshqa komponentlar va interfeyslarning istalgan axborot xavfsizligi tizimi holatini tavsiflaydi.": "Kiberxavfsizlik arxitekturasi",
        "Fishing hujumi usullari to‘g‘ri ko‘rsatilgan qatorni belgilang:": "1. Soxta havola, 2. Soxta lotereya, 4. Tekin dasturlar",
        "Axborot xavfsizligining (ma’lumotlarning butunligi, foydalana olish va zarur bo‘lganda, ma’lumotlarni kiritish, saqlash, qayta ishlash va uzatishda foydalaniluvchi axborot va uning zaxiralari konfidensialligi) muhim jihatlarini ta’minlashga yo‘naltirilgan tadbirlar majmui – bu:": "Axborot himoyasi",
        "Kompyuter jinoyatchiligi uchun javobgarlikni belgilovchi meyorlarni ishlab chiqish, dasturchilarning mualliflik huquqini himoyalash, jinoiy va fuqarolik qonunchiligini hamda sud jarayonini takomillashtirish qaysi choralarga kiradi?": "Huquqiy",
        "Tarmoqlararo ekran texnologiyasi-bu:": "Ichki va tashqi tarmoq o‘rtasida filtr va himoya vazifasini bajaradi.",
        "Kompyuter tizimlarining zaifligi-bu:": "Tizimga tegishli bo‘lgan noo‘rin xususiyat bo‘lib, tahdidlarni amalga oshishiga olib kelishi mumkin.",
        "Qaysi shifrlash algoritmi GSM tarmog‘ida foydalaniladi?": "A5/1",
        "Lokal simsiz tarmoqlarga tegishli texnologiyani ko‘rsating.": "WI-FI",
        "Simsiz tarmoqlar xavfsizligiga tahdidlarni ko‘rsating?": "Nazoratlanmaydigan hudud va yashirincha eshitish, bo‘g‘ish va xizmat ko‘rsatishdan voz kechish.",
        "Ma’lumotlarni saqlashda, qayta ishlashda va uzatishda himoyani ta’minlashni maqsad qiladi.": "Ma’lumotlar xavfsizligi",
        "Foydalanilayotgan tizim yoki axborot xavfsizligini ta’minlovchi dasturiy ta’minotlarni ishlab chiqish va foydalanish jarayoniga e’tibor qaratadi:": "Dasturiy ta’minotlar xavfsizligi",
        "Katta tizimlarda integrallashgan tashkil etuvchilarni loyihalash, sotib olish, testlash, analiz qilish va texnik xizmat ko‘rsatishga e’tibor qaratadi": "Tashkil etuvchilar xavfsizligi",
        "Tashkil etuvchilar o‘rtasidagi aloqani himoyalashga etibor qaratib, o‘zida fizik va mantiqiy ulanishni birlashtiradi.": "Aloqa xavfsizligi",
        "Xesh funksiya": "Ixtiyoriy uzunlikdagi (bit yoki bayt birliklarida) ma’lumotni biror fiksirlangan uzunlikdagi (bit yoki bayt birliklarida) qiymatga o‘tkazuvchi funksiya.",
        "Kompyuter tizimlarida tarqalish va o‘z-o‘zidan qaytadan tiklanish (replikatsiya) xususiyatlariga ega bo‘lgan bajariluvchi yoki sharxlanuvchi kichik dasturlardir:": "Kompyuter viruslari",
        "Fayl viruslari": "Bajariluvchi fayllarga turli usullar bilan kiritiladi (eng ko‘p tarqalgan viruslar xili), yoki fayl yo‘ldoshlarni (kompan’on viruslar) yaratadi yoki faylli tizimlarni (link viruslar) tashkil etish xususiyatidan foydalanadi.",
        "O‘zini diskning yuklama sektoriga (boot sektoriga) yoki vinchesterning tizimli yuklovchisi (Master Boot Record) bo‘lgan sektorga yozadi. Yuklama viruslar tizim yuklanishida boshqarishni oluvchi dastur kodi vazifasini bajaradi.": "Yuklama viruslar",
        "Axborotni ishlovchi zamonaviy tizimlarning makro dasturlarini va fayllarini, xususan MicroSoft Word, MicroSoft Excel va h. kabi ommaviy muharrirlarning fayl xujjatlarini va elektron jadvallarini zaharlaydi.": "Makroviruslar",
        "O‘zini tarqatishda kompyuter tarmoqlari va elektron pochta protokollari va komandalardan foydalanadi. Ba’zida ular \"qurt\" xilidagi dasturlar deb yuritishadi, Internet qurtlarga (Internet bo‘yicha tarqaladi), IRC-qurtlarga (chatlar, Internet Relay Chat) bo‘linadi.": "Tarmoq viruslari",
        "Hujumlarni aniqlash tizimining qisqartmasi ko‘rsatilgan qatorni toping?": "IDS",
        "Hujumni bartaraf etish tizimining qisqartmasi ko‘rsatilgan qatorni toping?": "IPS",
        "Qo‘yish, o‘rin almashtirish, gammalash kriptografiyaning qaysi turiga bog‘liq?": "Simmetrik kriptotizimlar",
        "Axborot xavfsizligining asosiy maqsadlaridan biri-bu…": "Axborotlarni o‘g‘irlanishini, yo‘qolishini, soxtalashtirilishini oldini olish.",
        "Windows OTda necha turdagi hodisa ro‘yxatga olinadi?": "5 ta",
        "Konfidentsiallikga to‘g‘ri ta’rif keltiring.": "Axborot inshonchliligi, tarqatilishi mumkin emasligi, maxfiyligi kafolati.",
        "Kriptografiya faninining asosiy maqsadi nima?": "Maxfiylik, yaxlitlilikni ta’minlash.",
        "Ro‘yxatdan o‘tish-bu…": "Foydalanuvchilarni ro‘yxatga olish va ularga dasturlar va ma’lumotlarni ishlatishga huquq berish jarayoni.",
        "Maxfiy xabarni soxta xabar ichiga berkitish orqali aloqani yashirish nima deb ataladi?": "Steganografiya.",
        "Kriptografiya fan sifatida shakllanishida nechta davrlarga bo‘linadi?": "4 ga.",
        "Shifrmatntni ochiq matntga akslantirish jarayoni nima deb ataladi?": "Deshifrlash.",
        "Risk-tushunchasi nima?": "Belgilangan sharoitda tahdidning manbalarga bo‘lishi mumkin bo‘lgan zarar yetkazilishini kutish.",
        "Tahdid-tushunchasi nima?": "Tashkilotga zarar yetkazishi mumkin bo‘lgan istalmagan hodisa.",
        "Kodlash terminiga berilgan ta’rifni belgilang.": "Ma’lumotni osongina qaytarish uchun hammaga ochiq bo‘lgan sxema yordamida ma’lumotlarni boshqa formatga o‘zgartirishdir.",
        "Axborotni shifrni ochish (deshifrlash) bilan qaysi fan shug‘ullanadi?": "Kriptoanaliz.",
        "Kiberjinoyat qanday turlarga bo‘linadi?": "Ichki va tashqi.",
        "O’zbekiston Respublikasining “Kiberxavfsizlik to‘g‘risida” Qonuni qachon tasdiqlangan?": "15.04.2022 y.",
        "Kiberjinoyatchilik bu –. . .": "Kompyuter yoki boshqa qurilmalarga qarshi qilingan yoki kompyuter va boshqa qurilmalar orqali qilingan jinoiy faoliyat.",
        "Axborot xavfsizligiga bo‘ladigan tahdidlarning qaysi biri tasodifiy tahdidlar deb hisoblanadi?": "Texnik vositalarning buzilishi va ishlamasligi.",
        "Axborotni uzatish va saqlash jarayonida o‘z strukturasi va yoki mazmunini saqlash xususiyati nima deb ataladi?": "Ma’lumotlar butunligi.",
        "Biometrik autentifikatsiyalashning afzalliklari-bu:": "Biometrik parametrlarning noyobligi.",
        "Simmetrik shifrlashning noqulayligi – bu:": "Maxfiy kalitlar bilan ayirboshlash zaruriyatidir.",
        "Token, smartkartalarda xavfsizlik tomonidan kamchiligi nimada?": "Qurilmani yo'qotilishi katta xavf olib kelishi mumkin.",
        "Ma’lumotlarni yo‘qolish sabab bo‘luvchi tabiiy tahdidlarni ko‘rsating": "Zilzila, yong‘in, suv toshqini va h.k.",
        "Zimmermann telegrami, Enigma shifri, SIGABA kriptografiyaning qaysi davriga to‘g‘ri keladi?": "1-2 jahon urushu davri.",
        "\"Fishing\" tushunchasi-bu…:": "Tashkilot va odamlarning maxsus va shaxsiy ma’lumotlarini olishga qaratilgan internet-hujumi.",
        "Axborot xavfsizligi boshqaruv tizimida \"Aktiv\" so'zi nimani anglatadi?": "Axborot xavfsizligida tashkilot uchun qimmatbaho bo‘lgan va himoyalanishi lozim bo‘lgan narsalar.",
        "Axborot xavfsizligi timsollarini ko'rsating.": "Alisa, Bob, Eva.",
        "Axborot xavfsizligin ta'minlashda birinchi darajadagi me’yoriy hujjat nomini belgilang.": "Qonunlar.",
        "Qaysi siyosat tizim resurslarini foydalanishda hech qanday cheklovlar qo'ymaydi?": "Nomuntazam siyosat.",
        "“Hаmmа nаrsа tа’qiqlаnаdi.” Bu qаysi xаvfsizlik siyosаtigа xos?": "Pаrаnoid siyosаti (Pаrаnoid Policy).",
        "Kompyuter yoki boshqa qurilmalarga qarshi qilingan yoki kompyuter va boshqa qurilmalar orqali qilingan jinoyat-…": "Kiberjinoyat deb ataladi.",
        "Qaysi siyosat turli hisoblash resurslaridan to'g'ri foydalanishni belgilaydi?": "Maqbul foydalanish siyosati.",
        "“Dasturiy ta’minotlar xavfsizligi” bilim sohasi - bu ...": "Foydalanilayotgan tizim yoki axborot xavfsizligini ta’minlovchi dasturiy ta’minotlarni ishlab chiqish va foydalanish jarayoniga e’tibor qaratadi.",
        "“Jamoat xavfsizligi” bilim sohasi - bu …": "U yoki bu darajada jamiyatda ta’sir ko‘rsatuvchi kiberxavfsizlik omillariga e’tibor qaratadi.",
        "“Ma’lumotlar xavfsizligi” bilim sohasi - bu …": "Ma’lumotlarni saqlashda, qayta ishlashda va uzatishda himoyani ta’minlashni maqsad qiladi.",
        "“Tizim xavfsizligi” bilim sohasi - bu …": "Tashkil etuvchilar, ulanishlar va dasturiy ta’minotdan iborat bo‘lgan tizim xavfsizligining aspektlariga e’tibor qaratadi.",
        "“Yaxlitlik” atamasiga berilgan ta’rifni belgilang.": "Bu yozilgan va xabar qilingan ma’luotlarning haqiqiyligini, to‘g’riligini, butunligini saqlash qobiliyati.",
        "……–hisoblashga asoslangan bilim sohasi bo‘lib, buzg‘unchilar mavjud bo‘lgan sharoitda amallarni kafolatlash uchun o‘zida texnologiya, inson, axborot va jarayonni mujassamlashtirgan.": "Kiberxavfsizlik.",
        "Assimetrikrik kriptotizimlarda axborotni shifrlashda va deshifrlash uchun qanday kalit ishlatiladi?": "Ikkita kalit: ochiq va yopiq.",
        "Autentifikatsiya jarayoni qanday jarayon?": "Obyekt yoki subyektni unga berilgan identifikatorga mosligini tekshirish va belgilar ketma-ketligidan iborat maxfiy axborotni tekshirish orqali asilligini aniqlash.",
        "Avtorizatsiya nima?": "Identifikatsiya va autentifikatsiyadan o‘tgan foydalanuvchilarga tizimda bajarishi mumkin bo‘lgan amallarga ruxsat berish jarayoni.",
        "Axborot o‘lchovini kamayish tartibini to‘g‘ri tanlang": "Terabayt, gigabayt, megabayt",
        "Axborot o‘lchovini o‘sish tartibini to‘g‘ri tanlang": "Kilobayt, megabayt, gigabayt",
        "Elektron raqamli imzo algoritmi qanday bosqichlardan iborat bo‘ladi?": "Imzo qo‘yish va imzoni tekshirish",
        "Elektron raqamli imzo kalitlari ro‘yxatga olish qaysi tashkilot tomonidan bajariladi?": "Sertifikatlari roʻyxatga olish markazlari",
        "Foydalanuvchini (yoki biror tomonni) tizimdan foydalanish uchun ruxsati mavjudligini aniqlash jarayoni nima?": "Autentifikatsiya",
        "Kriptografiyada kalit – bu …": "Matnni shifrlash va shifrini ochish uchun kerakli axborot",
        "Kiberetika tushunchasi-bu…": "Kompyuter va kompyuter tarmoqlarida odamlarning etikasi",
        "Kiberxavfsizlik siyosati tashkilotda nimani ta’minlaydi?": "Tashkilot masalalarini yechish himoyasini yoki ish jarayoni himoyasini ta’minlaydi",
        "Kriptografik elektron raqamli imzolarda qaysi kalitlar ma’lumotni yaxlitligini ta’minlashda qo‘llaniladi?": "Ochiq kalitlar",
        "Kriptografiyada 'alifbo' deganda nima tushuniladi?": "Axborotni ifodalashda ishlatiluvchi bilgilarning chekli to‘plami tushuniladi",
        "O‘zbekistonda masofadan elektron raqamli imzo olish uchun qaysi internet manzilga murojaat qilinadi?": "e-imzo.uz",
        "Oqimli shifrlashning mohiyati nimada?": "Oqimli shifrlash birinchi navbatda axborotni bloklarga bo‘lishning imkoni bo‘lmagan hollarda zarur",
        "RSA algoritmi qanday jarayonlardan tashkil topgan?": "Kalitni generatsiyalash; Shifrlash; Deshifrlash",
        "Shaxsning, o‘zini axborot-kommunikatsiya tizimiga tanishtirish jarayonida qo‘llaniladigan belgilar ketma-ketligi bo‘lib, axborot-kommunikatsiya tizimidan foydalanish huquqiga ega bo‘lish uchun foydalaniluvchining maxfiy bo‘lmagan qayd yozuvi – bu?": "Login",
        "Shifrlash qanday jarayon?": "Akslantirish jarayoni: ochiq matn deb nomlanadigan matn shifrmatnga almashtiriladi",
        "Kichik hajmdagi xotira va hisoblash imkoniyatiga ega bo‘lgan, o‘zida parol yoki kalitni saqlovchi qurilma nima deb ataladi?": "Token, Smartkarta",
        "Cisco tashkiloti 'kiberxavfsizlik' atamasiga qanday ta’rif bergan?": "Kiberxavfsizlik - tizim, tarmoq va dasturlarni raqamli hujumlardan himoyalash amaliyoti",
        "Qaysi hujumlar asosan portlarni va operatsion tizimni skanerlashni maqsad qiladi?": "Aktiv razvedka hujumlari",
        "Foydalanuvchanlik-bu…": "Avtorizatsiyalangan mantiqiy obyekt so‘rovi bo‘yicha axborotning tayyorlik va foydalanuvchanlik holatida bo‘lishi xususiyati",
        "Ijtimoiy (sotsial) injineriya-bu…": "Turli psixologik usullar va firibgarlik amaliyotining to‘plami, uning maqsadi firibgarlik yo‘li bilan shaxs to‘g‘risida maxfiy ma’lumotlarni olish.",
        "Kiberxavfsizlik arxitekturasi nechta sathga ajratiladi?": "3 ta.",
        "Tashkilot axborot xavfsizligi siyosati-bu…": "Mazkur siyosat turi tashkilot xavfsiz muhitini, unga g‘oya, maqsad va usullarni taklif qilish orqali, madadlaydi. U xavfsizlik dasturlarini ishlab chiqish, amalga oshirish va boshqarish usullarini belgilaydi.",
        "“Aloqa xavfsizligi” bilim sohasi - bu …": "Tashkil etuvchilar o‘rtasidagi aloqani himoyalashga etibor qaratib, o‘zida fizik va mantiqiy ulanishni birlashtiradi."
    }
}